{
  "text": ".",
  "children": [{
    "name": "Big guns",
    "children": [
      {
        "item_id": 0,
        "name": "RPG-7",
        "description": "The RPG-7 (Russian: РПГ-7) is a Soviet portable, unguided, shoulder-launched, anti-tank rocket-propelled grenade launcher. Originally the RPG-7 (Ручной Противотанковый Гранатомёт – Ruchnoy Protivotankovyy Granatomyot, Hand-held anti-tank grenade launcher) and its predecessor, the RPG-2, was designed by the Soviet Union; it is now manufactured by the Russian company Bazalt. The weapon has the GRAU index 6G3. The English-language term \"rocket-propelled grenade\", though frequently encountered and reasonably descriptive, is a backronym for \"RPG\" and not based on a literal translation.",
        "leaf": true
      },
      {
        "item_id": 1,
        "name": "M249 light machine gun",
        "description": "The M249 light machine gun (LMG), previously designated the M249 Squad Automatic Weapon (SAW), and formally written as Light Machine Gun, 5.56 mm, M249, is the American adaptation of the Belgian FN Minimi, a light machine gun manufactured by the Belgian company FN Herstal (FN). The M249 is manufactured in the United States by the local subsidiary FN Manufacturing LLC in South Carolina and is widely used in the U.S. Armed Forces. The weapon was introduced in 1984 after being judged the most effective of a number of candidate weapons to address the lack of automatic firepower in small units. The M249 provides infantry squads with the heavy volume of fire of a machine gun combined with accuracy and portability approaching that of a rifle.",
        "leaf": true
      }
    ]
  },
  {
    "name": "Small guns",
    "children": [
      {
        "item_id": 2,
        "name": "M1911 pistol",
        "description": "The M1911 is a single-action, semi-automatic, magazine-fed, recoil-operated pistol chambered for the .45 ACP cartridge, which served as the standard-issue sidearm for the United States armed forces from 1911 to 1985. It was first used in later stages of the Philippine-American War, and was widely used in World War I, World War II, the Korean War, and the Vietnam War. The M1911 is still carried by some U.S. forces. Its formal designation as of 1940 was Automatic Pistol, Caliber .45, M1911 for the original Model of 1911 or Automatic Pistol, Caliber .45, M1911A1 for the M1911A1, adopted in 1924.",
        "leaf": true
      },
      {
        "item_id": 3,
        "name": "Glock",
        "description": "The Glock pistol, sometimes referred to by the manufacturer as Glock \"Safe Action\" Pistol, is a series of semi-automatic pistols designed and produced by Glock Ges.m.b.H., located in Deutsch-Wagram, Austria. The company's founder, engineer Gaston Glock, had no experience with firearm design or manufacture at the time their first pistol, the Glock 17, was being prototyped.",
        "leaf": true
      }
    ]}
  ]
}